app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Yuri"], ["updated_at", "2024-08-09 16:52:20.091880"], ["id", 3]]
---
    def update
        find_student
        @student.update(post_params(:first_name, :last_name))